#ifndef GRAPH_CONSTANTS_H
#define GRAPH_CONSTANTS_H

const int CA = 4;
const int NA = 3;
const int TA_M = 8;
const int SC = 2; // 1 or 2

#endif //GRAPH_CONSTANTS_H

//Время всех процессов: 24051.9
//Время программы: 4210.43
//Перебор матриц потоками окончен: 15:31:08
//==============================
//Матриц перебрали все потоки: 36259479363
//Дошли до проверки на эквивалентность: 8811527
//Всего возможных матриц: 195746
//Время всех процессов: 25128.6
//Время программы: 4391.61
//Получены возможные матрицы: 15:34:09
//==============================
//Всего допустимых матриц: 0
//Время всех процессов: 26482.3
//Время программы: 4624.18
//Получены раскраски: 15:38:01
//==============================
//

//0 0 0 3
//0 0 2 1
//0 2 0 1
//1 1 1 0
//
//0 0 1 2
//0 0 1 2
//1 1 1 0
//1 1 0 1
//
//0 1 0 2
//1 0 2 0
//0 1 1 1
//1 0 1 1
//
//0 1 1 1
//2 1 0 0
//2 0 1 0
//2 0 0 1
//
//0 1 1 1
//3 0 0 0
//1 0 1 1
//1 0 1 1
//
//0 2 0 1
//2 0 1 0
//0 1 1 1
//1 0 1 1
//
//0 2 0 1
//2 0 1 0
//0 1 2 0
//1 0 0 2

//Время всех процессов: 112908
//Время программы: 20551.5
//Перебор матриц потоками окончен: 01:03:12
//==============================
//Матриц перебрали все потоки: 904116864117
//Дошли до проверки на эквивалентность: 12908539
//Всего возможных матриц: 284727
//Время всех процессов: 115088
//Время программы: 20919.4
//Получены возможные матрицы: 01:09:20
//==============================
//0 0 0 0 0 0 0 1 1 1
//0 0 0 0 0 1 1 0 0 1
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 1 0 1 0 0
//0 0 1 1 0 0 0 0 0 1
//0 1 0 1 0 0 0 0 1 0
//0 1 1 0 0 0 0 1 0 0
//1 0 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//1 1 0 0 1 0 0 0 0 0
//
//0 0 0 0 0 0 1 1 0 1
//0 0 0 0 0 2 0 1 0 0
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 1 0 0 1 0
//0 0 1 1 0 0 0 0 0 1
//0 1 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//2 1 0 0 0 0 0 0 0 0
//0 0 1 1 0 0 0 0 1 0
//1 0 0 0 1 0 0 0 0 1
//
//0 0 0 0 0 0 1 1 0 1
//0 0 0 0 0 2 0 1 0 0
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 2 0 0 0 0
//0 0 2 1 0 0 0 0 0 0
//0 1 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//2 1 0 0 0 0 0 0 0 0
//0 0 1 0 0 0 0 0 1 1
//1 0 0 0 0 0 0 0 1 1
//
//0 0 0 0 0 1 1 1 0 0
//0 0 0 1 1 0 0 1 0 0
//0 0 0 0 1 0 1 0 0 1
//0 1 0 0 0 0 1 0 0 1
//0 1 1 0 0 1 0 0 0 0
//1 0 0 0 1 0 0 0 1 0
//1 0 1 1 0 0 0 0 0 0
//1 1 0 0 0 0 0 0 1 0
//0 0 0 0 0 1 0 1 1 0
//0 0 1 1 0 0 0 0 0 1
//
//Всего допустимых матриц: 4
//Время всех процессов: 118236
//Время программы: 21452.7
//Получены раскраски: 01:18:13
//==============================


//Поток 0x16f4bb000 завершил свою работу
//2151918
//2845113
//4456243
//0
//
//Поток 0x16f65f000 завершил свою работу
//        Поток 0x16f547000 завершил свою работу
//        Поток 0x16f42f000 завершил свою работу
//        Поток 0x16f6eb000 завершил свою работу
//        Поток 0x16f5d3000 завершил свою работу
//1627858
//2207711
//4433198
//0
//
//1489120
//2378523
//4353494
//0
//
//1872208
//2481473
//5204373
//0
//
//1913081
//3118875
//4307913
//0
//
//1445219
//2200978
//4144562
//0
//
//Время всех процессов: 112908
//Время программы: 20551.5
//Перебор матриц потоками окончен: 01:03:12
//==============================
//Матриц перебрали все потоки: 904116864117
//Дошли до проверки на эквивалентность: 12908539
//Всего возможных матриц: 284727
//Время всех процессов: 115088
//Время программы: 20919.4
//Получены возможные матрицы: 01:09:20
//==============================
//0 0 0 0 0 0 0 1 1 1
//0 0 0 0 0 1 1 0 0 1
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 1 0 1 0 0
//0 0 1 1 0 0 0 0 0 1
//0 1 0 1 0 0 0 0 1 0
//0 1 1 0 0 0 0 1 0 0
//1 0 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//1 1 0 0 1 0 0 0 0 0
//
//0 0 0 0 0 0 1 1 0 1
//0 0 0 0 0 2 0 1 0 0
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 1 0 0 1 0
//0 0 1 1 0 0 0 0 0 1
//0 1 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//2 1 0 0 0 0 0 0 0 0
//0 0 1 1 0 0 0 0 1 0
//1 0 0 0 1 0 0 0 0 1
//
//0 0 0 0 0 0 1 1 0 1
//0 0 0 0 0 2 0 1 0 0
//0 0 0 0 1 0 1 0 1 0
//0 0 0 0 1 2 0 0 0 0
//0 0 2 1 0 0 0 0 0 0
//0 1 0 1 0 0 1 0 0 0
//1 0 1 0 0 1 0 0 0 0
//2 1 0 0 0 0 0 0 0 0
//0 0 1 0 0 0 0 0 1 1
//1 0 0 0 0 0 0 0 1 1
//
//0 0 0 0 0 1 1 1 0 0
//0 0 0 1 1 0 0 1 0 0
//0 0 0 0 1 0 1 0 0 1
//0 1 0 0 0 0 1 0 0 1
//0 1 1 0 0 1 0 0 0 0
//1 0 0 0 1 0 0 0 1 0
//1 0 1 1 0 0 0 0 0 0
//1 1 0 0 0 0 0 0 1 0
//0 0 0 0 0 1 0 1 1 0
//0 0 1 1 0 0 0 0 0 1
//
//Всего допустимых матриц: 4
//Время всех процессов: 118236
//Время программы: 21452.7
//Получены раскраски: 01:18:13
//==============================
